goc9000/megas2/src/devices/atmega32_core.cpp
#include <inttypes.h>
#include <cstdlib>
#include <cstring>

#include "utils/bit_macros.h"
#include "utils/fail.h"
#include "atmega32.h"
#include "atmega32_core.h"
#include "atmega32_defs.h"

typedef void (*inst_fn_t)(Atmega32Core*, uint16_t);

static inst_fn_t fn_table[65536];
static bool fn_table_initialized = false;

static inline bool is_double_width_instruction(uint16_t opcode)
{
    return
        ((opcode & 0xfc0f) == 0x9000) || // LDS/STS
        ((opcode & 0xfe0c) == 0x940c); // JMP/CALL
}

static uint8_t read_reg(Atmega32Core *core, uint8_t reg)
{
    return core->ram[reg];
}

static uint16_t read_16bit_reg(Atmega32Core *core, uint8_t reg)
{
    return (core->ram[reg+1] << 8) + core->ram[reg];
}

static void write_reg(Atmega32Core *core, uint8_t reg, uint8_t value)
{
    core->ram[reg] = value;
}

static void write_16bit_reg(Atmega32Core *core, uint8_t reg, uint16_t value)
{
    core->ram[reg] = low_byte(value);
    core->ram[reg+1] = high_byte(value);
}

static bool read_reg_bit(Atmega32Core *core, uint8_t reg, uint8_t bit)
{
    return bit_is_set(core->ram[reg], bit);
}

static void write_reg_bit(Atmega32Core *core, uint8_t reg, uint8_t bit, bool value)
{
    if (value) {
        set_bit(core->ram[reg], bit);
    } else {
        clear_bit(core->ram[reg], bit);
    }
}

static void set_flag(Atmega32Core *core, uint8_t bit, bool value)
{
    write_reg_bit(core, REG_SREG, bit, value);
}

static bool get_flag(Atmega32Core *core, uint8_t bit)
{
    return read_reg_bit(core, REG_SREG, bit);
}

static uint8_t read_port(Atmega32Core *core, uint8_t port)
{
    uint8_t value = core->ram[IO_BASE + port];
    
    core->master->_onPortRead(port, -1, value);
    
    return value;
}

static bool read_port_bit(Atmega32Core *core, uint8_t port, uint8_t bit)
{
    uint8_t value = core->ram[IO_BASE + port];
    
    core->master->_onPortRead(port, bit, value);
    
    return bit_is_set(value, bit);
}

static void write_port(Atmega32Core *core, uint8_t port, uint8_t value)
{
    uint8_t prev_val = core->ram[IO_BASE + port];
    
    core->master->_onPortWrite(port, -1, value, prev_val);
    
    core->ram[IO_BASE + port] = value;
}

static void write_port_bit(Atmega32Core *core, uint8_t port, uint8_t bit, bool value)
{
    uint8_t prev_val = core->ram[IO_BASE + port];
    uint8_t new_val = (prev_val & ~(1 << bit)) | (value << bit);
    
    core->master->_onPortWrite(port, bit, new_val, prev_val);
    
    core->ram[IO_BASE + port] = new_val;
}

static uint8_t read_mem(Atmega32Core *core, int addr)
{
    if (addr >= RAM_SIZE)
        fail("Read from invalid address (%04x)", addr);
    
    if (addr < IO_BASE) {
        return read_reg(core, addr);
    } else if (addr < SRAM_BASE) {
        return read_port(core, addr - IO_BASE);
    } else
        return core->ram[addr];
}

static void write_mem(Atmega32Core *core, int addr, uint8_t value)
{
    if (addr >= RAM_SIZE)
        fail("Read from invalid address (%04x)", addr);
        
    if (addr < IO_BASE)  {
        write_reg(core, addr, value);
    } else if (addr < SRAM_BASE) {
        write_port(core, addr - IO_BASE, value);
    } else
        core->ram[addr] = value;
}

static uint16_t fetch_next_opcode(Atmega32Core *core)
{
    if (core->pc >= FLASH_SIZE) {
        fail("Attempted fetch from invalid address %s%04x (last instr fetched at %04x)",
            core->pc, core->last_inst_pc);
    }
    
    uint16_t opcode = core->flash[core->pc++];

    return opcode;
}

static void skip_instruction(Atmega32Core *core)
{
    uint16_t opcode = fetch_next_opcode(core);
    
    if (is_double_width_instruction(opcode))
        fetch_next_opcode(core);
}

static void do_jump(Atmega32Core *core, int address)
{
    if ((address < 0) || (address >= FLASH_SIZE)) {
        fail("Attempted jump to invalid address %s%04x (last instr fetched at %04x)",
            (address < 0) ? "-" : "", abs(address), core->last_inst_pc);
    }
    
    core->pc = address;
}

static void do_rel_jump(Atmega32Core *core, int displacement)
{
    do_jump(core, core->pc + displacement);
}

static void push(Atmega32Core *core, uint8_t value)
{
    uint16_t sp = read_16bit_reg(core, REG16_SP);
    write_mem(core, sp, value);
    write_16bit_reg(core, REG16_SP, sp-1);
}

static uint8_t pop(Atmega32Core *core)
{
    uint16_t sp = read_16bit_reg(core, REG16_SP);
    uint8_t value = read_mem(core, ++sp);
    write_16bit_reg(core, REG16_SP, sp);

    return value;
}

static void push_word(Atmega32Core *core, uint16_t value)
{
    push(core, low_byte(value));
    push(core, high_byte(value));
}

static uint16_t pop_word(Atmega32Core *core)
{
    return (pop(core) << 8) + pop(core);
}

static void do_load_store(Atmega32Core *core, uint8_t addr_reg, uint16_t displ,
    uint8_t dest_reg, uint8_t incrementing, bool store)
{
    uint16_t a = read_16bit_reg(core, addr_reg);
    
    if (incrementing == 2)
        write_16bit_reg(core, addr_reg, --a);
    if (store) {
        write_mem(core, a + displ, read_reg(core, dest_reg));
    } else {
        write_reg(core, dest_reg, read_mem(core, a + displ));
    }
    if (incrementing == 1)
        write_16bit_reg(core, addr_reg, a+1);
}

static void load_prog_mem(Atmega32Core *core, uint8_t dest_reg, bool post_increment, bool extended)
{
    uint16_t z = read_16bit_reg(core, REG16_Z);
    
    if (extended)
        fail("Extended LPM not supported");
    
    if (z >= 2*FLASH_SIZE)
        fail("LPM from invalid program memory address (%04x)", z);
    
    core->ram[dest_reg] = (z & 1) ?
        high_byte(core->flash[z >> 1]) :
        low_byte(core->flash[z >> 1]);
    
    if (post_increment)
        write_16bit_reg(core, REG16_Z, z+1);
}

static void do_add(Atmega32Core *core, uint8_t dest_reg, uint8_t value, bool carry)
{
    uint8_t d = read_reg(core, dest_reg);
    uint8_t result = d + value + (carry & get_flag(core, FLAG_C));
    
    set_flag(core, FLAG_H, bit_is_set((d & value) | (value & ~result) | (~result & d), 3));
    set_flag(core, FLAG_C, bit_is_set((d & value) | (value & ~result) | (~result & d), 7));
    set_flag(core, FLAG_V, (d & value & ~result) | (~d & ~value & result));
    set_flag(core, FLAG_N, bit_is_set(result, 7));
    set_flag(core, FLAG_Z, !result);
    set_flag(core, FLAG_S, get_flag(core, FLAG_N) ^ get_flag(core, FLAG_V));
    
