goc9000/megas2/src/devices/atmega32_core.cpp
    write_reg(core, dest_reg, result);
}

static void do_cp_or_sub(Atmega32Core *core, uint8_t dest_reg, uint8_t value, bool carry, bool store)
{
    uint8_t d = read_reg(core, dest_reg);
    uint8_t result = d - value - (carry & get_flag(core, FLAG_C));
    
    set_flag(core, FLAG_H, bit_is_set((~d & value) | (value & result) | (result & ~d), 3));
    set_flag(core, FLAG_C, bit_is_set((~d & value) | (value & result) | (result & ~d), 7));
    set_flag(core, FLAG_V, (d & ~value & ~result) | (~d & value & result));
    set_flag(core, FLAG_N, bit_is_set(result, 7));
    set_flag(core, FLAG_Z, !result & (!carry | get_flag(core, FLAG_Z)));
    set_flag(core, FLAG_S, get_flag(core, FLAG_N) ^ get_flag(core, FLAG_V));
    
    if (store)
        write_reg(core, dest_reg, result);
}

static void set_logical_op_flags(Atmega32Core *core, uint8_t result)
{
    set_flag(core, FLAG_N, bit_is_set(result, 7));
    set_flag(core, FLAG_Z, !result);
    set_flag(core, FLAG_S, get_flag(core, FLAG_N) ^ get_flag(core, FLAG_V));
    set_flag(core, FLAG_V, 0);
}

static void exec_movw(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned r_h : 4;
        unsigned d_h : 4;
        unsigned : 8;
    } *ins = (inst *)&opcode;
    
    write_16bit_reg(core, ins->d_h * 2, read_16bit_reg(core, ins->r_h * 2));
}

static void exec_multiplications(Atmega32Core *core, uint16_t opcode)
{
    union inst {
        struct {
            unsigned r_l : 4;
            unsigned d : 5;
            unsigned r_h : 1;
            unsigned marker : 1;
            unsigned : 5;
        } as_mul;
        struct {
            unsigned r_l : 4;
            unsigned d_l : 4;
            unsigned marker : 1;
            unsigned : 7;
        } as_muls;
        struct {
            unsigned r_l : 3;
            unsigned opcode0 : 1;
            unsigned d_l : 3;
            unsigned opcode1 : 1;
            unsigned : 8;
        } as_other;
    } *ins = (inst *)&opcode;
    
    uint8_t d;
    uint8_t r;
    bool d_signed = false;
    bool r_signed = false;
    bool fractional = false;
    
    if (ins->as_mul.marker) {
        d = ins->as_mul.d;
        r = (ins->as_mul.r_h << 4) + ins->as_mul.r_l;
    } else if (!ins->as_muls.marker) {
        d = 16 + ins->as_muls.d_l;
        r = 16 + ins->as_muls.r_l;
        d_signed = r_signed = true;
    } else {
        d = 16 + ins->as_other.d_l;
        r = 16 + ins->as_other.r_l;
        d_signed = !ins->as_other.opcode0 | ins->as_other.opcode1;
        r_signed = ins->as_other.opcode1;
        fractional = ins->as_other.opcode0 | ins->as_other.opcode1;
    }
    
    if (fractional)
        fail("FMUL instructions not supported");
    
    int d_val = d_signed ? ((int8_t)read_reg(core, d)) : read_reg(core, d);
    int r_val = d_signed ? ((int8_t)read_reg(core, r)) : read_reg(core, r);
    int result = (d_val * r_val) & 0xffff;
    
    write_reg(core, 0, low_byte(result));
    write_reg(core, 1, high_byte(result));
    set_flag(core, FLAG_C, bit_is_set(result, 15));
    set_flag(core, FLAG_Z, !result);
}

static void exec_reg_reg_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned r_l : 4;
        unsigned d : 5;
        unsigned r_h : 1;
        unsigned opcode : 6;
    } *ins = (inst *)&opcode;
    
    int op = ins->opcode;
    int d = ins->d;
    int r = (ins->r_h << 4) + ins->r_l;
    uint8_t d_val = read_reg(core, d);
    uint8_t r_val = read_reg(core, r);
    
    switch (op) {
        case 0x01: // CPC
        case 0x02: // SBC
        case 0x05: // CP
        case 0x06: // SUB
            do_cp_or_sub(core, d, r_val, (op <= 0x02), !(op & 0x01));
            break;
        case 0x03: // ADD
        case 0x07: // ADC
            do_add(core, d, r_val, (op == 0x07));
            break;
        case 0x04: // CPSE
            if (d_val == r_val)
                skip_instruction(core);
            break;
        case 0x08: // AND
        case 0x09: // EOR
        case 0x0a: // OR
            switch (op) {
                case 0x08: d_val &= r_val; break;
                case 0x09: d_val ^= r_val; break;
                case 0x0a: d_val |= r_val; break;
            }
            
            write_reg(core, d, d_val);
            set_logical_op_flags(core, d_val);
            break;
        case 0x0b: // MOV
            write_reg(core, d, r_val);
            break;
        default:
            fail("Unsupported two-reg instruction %04x", opcode);
    }
}

static void exec_reg_imm_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned val_l : 4;
        unsigned d_l : 4;
        unsigned val_h : 4;
        unsigned opcode : 4;    
    } *ins = (inst *)&opcode;
    
    int d = 16 + ins->d_l;
    uint8_t d_val = read_reg(core, d);
    uint8_t val = (ins->val_h << 4) + ins->val_l;
    
    switch (ins->opcode) {
        case 0x03: // CPI
            do_cp_or_sub(core, d, val, false, false);
            break;
        case 0x04: // SBCI
            do_cp_or_sub(core, d, val, true, true);
            break;
        case 0x05: // SUBI
            do_cp_or_sub(core, d, val, false, true);
            break;
        case 0x06: // ORI
        case 0x07: // ANDI
            switch (ins->opcode) {
                case 0x06: d_val |= val; break;
                case 0x07: d_val &= val; break;
            }
            
            set_logical_op_flags(core, d_val);
            write_reg(core, d, d_val);
            break;
        case 0x0e: // LDI
            write_reg(core, d, val);
            break;
        default:
            fail("Unsupported immediate instruction %04x", opcode);
    }
}

static void exec_ldd(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned q_l : 3;
        unsigned use_y : 1;
        unsigned d : 5;
        unsigned store : 1;
        unsigned q_m : 2;
        unsigned : 1;
        unsigned q_h : 1;
        unsigned : 2;    
    } *ins = (inst *)&opcode;
    
    uint8_t q = (ins->q_h << 5) + (ins->q_m << 3) + ins->q_l; 
    
    do_load_store(core, ins->use_y ? REG16_Y : REG16_Z, q, ins->d, 0, ins->store);
}

static void exec_reg_mem_op(Atmega32Core *core, uint16_t opcode)
{
    uint8_t const IND_REGS[4] = { REG16_Z, 0, REG16_Y, REG16_X };
    
