goc9000/megas2/src/devices/atmega32_core.cpp
    struct inst {
        unsigned opcode : 4;
        unsigned d : 5;
        unsigned store : 1;
        unsigned : 6;
    } *ins = (inst *)&opcode;
    
    int d = ins->d;
    uint8_t d_val = read_reg(core, d);
    bool store = ins->store;
    uint8_t op = ins->opcode;
    uint16_t addr;
  
    switch (op) {
        case 0x00: // LDS/STS
            addr = fetch_next_opcode(core);
            if (store) {
                write_mem(core, addr, d_val);
            } else {
                write_reg(core, d, read_mem(core, addr));
            }
            break;
        case 0x04: case 0x05: case 0x06: case 0x07: // specials
            if (!store) { // LPM
                load_prog_mem(core, d, bit_is_set(op, 0), bit_is_set(op, 1));
            } else { // atomics
                fail("Unsupported atomic instruction %04x", opcode);
            }
            break;
        case 0x01: case 0x02: case 0x09: case 0x0a: case 0x0c: case 0x0d: case 0x0e: // indirect LD/ST
            do_load_store(core, IND_REGS[op >> 2], 0, d, op & 0x03, store);
            break;
        case 0x0f: // PUSH/POP
            if (store) {
                push(core, d_val);
            } else {
                write_reg(core, d, pop(core));
            }
            break;
        default:
            fail("Unsupported reg-mem instruction %04x", opcode);
    }
}

static void exec_flag_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned : 4;
        unsigned bit : 3;
        unsigned clear : 1;
        unsigned : 8;
    } *ins = (inst *)&opcode;
    
    set_flag(core, ins->bit, !ins->clear);
}

static void exec_long_jump(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned addr_l : 1;
        unsigned call : 1;
        unsigned : 2;
        unsigned addr_h : 5;
        unsigned : 7;
    } *ins = (inst *)&opcode;

    int addr = fetch_next_opcode(core);
    
    if (ins->call)
        push_word(core, core->pc);
    
    do_jump(core, addr + (ins->addr_l << 16) + (ins->addr_h << 17));
}

static void exec_single_reg_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned opcode : 4;
        unsigned d : 5;
        unsigned : 7;
    } *ins = (inst *)&opcode;
    
    uint8_t d = ins->d;
    uint8_t d_val = read_reg(core, ins->d);
    uint8_t res = 0;
    
    switch (ins->opcode) {
        case 0x00: // COM
            res = ~d_val;
            set_flag(core, FLAG_C, 1);
            set_flag(core, FLAG_V, 0);
            break;
        case 0x01: // NEG
            res = ~d_val + 1;
            set_flag(core, FLAG_H, bit_is_set(res | d_val, 3));
            set_flag(core, FLAG_C, !!res);
            set_flag(core, FLAG_V, (res == 0x80));
            break;
        case 0x02: // SWAP
            res = (d_val << 4) + ((d_val >> 4) & 15);
            break;
        case 0x03: // INC
            res = d_val+1;
            set_flag(core, FLAG_V, (d_val == 0x7f));
            break;
        case 0x05: // ASR
        case 0x06: // LSR
        case 0x07: // ROR
            uint8_t top_bit;
            switch (ins->opcode) {
                case 0x05: top_bit = bit_is_set(d_val, 7); break;
                case 0x06: top_bit = 0; break;
                case 0x07: top_bit = get_flag(core, FLAG_C); break;
            }
            res = ((d_val >> 1) & 0x7f) | (top_bit << 7);
            set_flag(core, FLAG_C, bit_is_set(d_val, 0));
            set_flag(core, FLAG_V, bit_is_set(d_val, 0) ^ top_bit);
            break;
        case 0x0a: // DEC
            res = d_val-1;
            set_flag(core, FLAG_V, (d_val == 0x80));
            break;
        default:
            fail("Unsupported single-reg instruction %04x", opcode);
    }
    
    if (ins->opcode != 0x02) {
        set_flag(core, FLAG_Z, !res);
        set_flag(core, FLAG_N, bit_is_set(res, 7));
        set_flag(core, FLAG_S, get_flag(core, FLAG_N) ^ get_flag(core, FLAG_V));
    }
    
    write_reg(core, d, res);
}

static void exec_indirect_jump(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned : 4;
        unsigned extended : 1;
        unsigned : 3;
        unsigned call : 1;
        unsigned : 7;
    } *ins = (inst *)&opcode;
    
    if (ins->extended)
        fail("Extended IJMP/ICALL not supported");
    
    if (ins->call)
        push_word(core, core->pc);
    
    do_jump(core, read_16bit_reg(core, REG16_Z));
}

static void exec_return(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned : 4;
        unsigned from_irq : 1;
        unsigned : 11;
    } *ins = (inst *)&opcode;
    
    uint16_t addr = pop_word(core);
    
    do_jump(core, addr);
    
    if (ins->from_irq)
        set_flag(core, FLAG_I, true);
}

static void exec_mcu_control_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned : 4;
        unsigned op : 2;
        unsigned : 10;
    } *ins = (inst *)&opcode;
    
    switch (ins->op) {
        case 0x00: // SLEEP
            // TODO: sleep not supported yet, just do nothing
            break;
        case 0x01: // BREAK
            // TODO: not supported yet, just do nothing
            break;
        case 0x02: // WDR
            // TODO: watchdog not supported yet, just do nothing
            break;
        default:
            fail("Unsupported MCU control instruction %04x", opcode);
    }
}

static void exec_prog_mem_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned : 4;
        unsigned extended : 1;
        unsigned store : 1;
        unsigned : 10;
    } *ins = (inst *)&opcode;
    
    if (ins->store)
        fail("SPM instructions not supported");
    
    load_prog_mem(core, 0, 0, ins->extended);
}

static void exec_word_imm_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned val_l : 4;
        unsigned d : 2;
        unsigned val_h : 2;
        unsigned subtract : 1;
        unsigned : 7;
    } *ins = (inst *)&opcode;
    
    int d = 24 + (2 * ins->d);
    
