goc9000/megas2/src/devices/atmega32_core.cpp
    uint16_t d_val = read_16bit_reg(core, d);
    uint16_t value = (ins->val_h << 4) + ins->val_l;
    uint16_t result;
    
    if (!ins->subtract) { // ADIW
        result = d_val + value;
        
        set_flag(core, FLAG_V, bit_is_set(~d_val & result, 15));
        set_flag(core, FLAG_C, bit_is_set(~result & d_val, 15));
    } else { // SBIW
        result = d_val - value;
        
        set_flag(core, FLAG_V, bit_is_set(d_val & ~result, 15));
        set_flag(core, FLAG_C, bit_is_set(result & ~d_val, 15));
    }
    
    set_flag(core, FLAG_N, bit_is_set(result, 15));
    set_flag(core, FLAG_Z, !result);
    set_flag(core, FLAG_S, get_flag(core, FLAG_N) ^ get_flag(core, FLAG_V));
    
    write_16bit_reg(core, d, result);
}

static void exec_io_bit_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned bit : 3;
        unsigned port : 5;
        unsigned is_sbix : 1;
        unsigned value : 1;
        unsigned : 6;
    } *ins = (inst *)&opcode;

    if (ins->is_sbix) { // SBIx
        if (read_port_bit(core, ins->port, ins->bit) == ins->value)
            skip_instruction(core);
    } else { // xBI
        write_port_bit(core, ins->port, ins->bit, ins->value);
    }
}

static void exec_io(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned port_l : 4;
        unsigned r : 5;
        unsigned port_h : 2;
        unsigned is_out : 1;
        unsigned : 4;
    } *ins = (inst *)&opcode;

    int port = (ins->port_h << 4) + ins->port_l;
        
    if (ins->is_out) {
        write_port(core, port, read_reg(core, ins->r));
    } else {
        write_reg(core, ins->r, read_port(core, port));
    }
}

static void exec_relative_jump(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        signed displ : 12;
        unsigned call : 1;
        unsigned : 3;
    } *ins = (inst *)&opcode;
    
    if (ins->call)
        push_word(core, core->pc);

    do_rel_jump(core, (int)ins->displ);
}

static void exec_branch(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned bit : 3;
        signed displ : 7;
        unsigned on_zero : 1;
        unsigned : 5;
    } *ins = (inst *)&opcode;
    
    if (get_flag(core, ins->bit) != ins->on_zero)
        do_rel_jump(core, (int)ins->displ);
}

static void exec_bit_op(Atmega32Core *core, uint16_t opcode)
{
    struct inst {
        unsigned bit : 3;
        unsigned : 1;
        unsigned r : 5;
        unsigned val_store : 1;
        unsigned is_branch : 1;
        unsigned : 5;
    } *ins = (inst *)&opcode;

    if (ins->is_branch) { // SBRx
        if (read_reg_bit(core, ins->r, ins->bit) == ins->val_store)
            skip_instruction(core);
    } else { // BLD/BST
        if (ins->val_store) {
            set_flag(core, FLAG_T, read_reg_bit(core, ins->r, ins->bit));
        } else {
            write_reg_bit(core, ins->r, ins->bit, get_flag(core, FLAG_T));
        }
    }
}

static void exec_nop(Atmega32Core *core, uint16_t opcode)
{
}

static void exec_not_implemented(Atmega32Core *core, uint16_t opcode)
{
    fail("Unsupported instruction %04x at PC=%04x", opcode, core->last_inst_pc);
}

static void init_fn_table()
{
    if (fn_table_initialized)
        return;
    
    for (int op = 0; op < 65536; op++) {
        inst_fn_t fn = exec_not_implemented;
        
        if ((op & 0xfe00) == 0x9600) { // ADIW/SBIW
            fn = exec_word_imm_op;
        } else if ((op >= 0x0400) && (op <= 0x2fff)) { // CPC/SBC/ADD/LSL/CPSE/CP/SUB/ADC/ROL/AND/TST/EOR/CLR/OR/MOV
            fn = exec_reg_reg_op;
        } else if ((op & 0xfc00) == 0x9000) { // LD[S]/ST[S]/[E]LPM/XCH/LAx/PUSH/POP
            fn = exec_reg_mem_op;
        } else if (((op >= 0x3000) && (op <= 0x7fff)) || ((op & 0xf000) == 0xe000)) { // CPI/SBCI/SUBI/ORI/SBR/ANDI/CBR
            fn = exec_reg_imm_op;
        } else if ((op & 0xf000) == 0xb000) { // IN/OUT
            fn = exec_io;
        } else if (((op & 0xfe00) == 0x9400) && (((op & 0x0f) <= 0x07) || ((op & 0x0f) == 0x0a))) { // COM/NEG/SWAP/INC/ASR/LSR/ROR/DEC
            fn = exec_single_reg_op;
        } else if ((op & 0xfeef) == 0x9409) { // [E]IJMP/[E]ICALL
            fn = exec_indirect_jump;
        } else if ((op & 0xffef) == 0x9508) { // RET[I]
            fn = exec_return;
        } else if ((op & 0xe000) == 0xc000) { // RJMP/RCALL
            fn = exec_relative_jump;
        } else if ((op & 0xffcf) == 0x95c8) { // [E]LPM/SPM
            fn = exec_prog_mem_op;
        } else if ((op & 0xfc00) == 0x9800) { // CBI/SBI/SBIC/SBIS
            fn = exec_io_bit_op;
        } else if ((op & 0xf800) == 0xf000) { // BRBS/BRBC
            fn = exec_branch;
        } else if ((op & 0xf800) == 0xf800) { // BLD/BST/SBRC/SBRS
            fn = exec_bit_op;
        } else if ((op & 0xff00) == 0x0100) { // MOVW
            fn = exec_movw;
        } else if ((op & 0xd000) == 0x8000) { // LDD/STD Rd, X/Y+q
            fn = exec_ldd;
        } else if ((op & 0xfe0c) == 0x940c) { // JUMP/CALL
            fn = exec_long_jump;
        } else if ((op & 0xff0f) == 0x9408) { // BSET/BCLR 
            fn = exec_flag_op;
        } else if (((op & 0xfe00) == 0x0200) || ((op & 0xfc00) == 0x9c00)) { // [F]MUL[S][U]
            fn = exec_multiplications;
        } else if ((op & 0xffcf) == 0x9588) { // SLEEP/BREAK/WDR
            fn = exec_mcu_control_op;
        } else if (!op) { // NOP
            fn = exec_nop;
        } else if ((op & 0xff0f) == 0x940b) { // DES
            fn = exec_not_implemented;
        }
        
        fn_table[op] = fn;
    }
    
    fn_table_initialized = true;
}

void atmega32_core_init(Atmega32Core *core, Atmega32 *master)
{
    init_fn_table();
    
    core->master = master;
    memset(core->flash, 0xFF, 2*FLASH_SIZE);
}

void atmega32_core_step(Atmega32Core *core)
{
    core->last_inst_pc = core->pc;
    
    uint16_t op = fetch_next_opcode(core);
    
    fn_table[op](core, op);
}
